1. ферма - радиус = квадрат 2 кл. с каждой пустой (= не занятой) клетки травы +1 еда в тик. сама ферма дает +5 в тик.
2. школа - радиус = квадрат 3 кл. 
3. Каждый игрок видит курсор другого игрока
4. убрать требование клиники и полиции для заселения дома. (только для заселения дома, а не для удовлетворения потребностей жителей)
5. если дом с жителями внутри находится вне радуса влияния более 2 дней, то жители из дома уезжают(+исчезают). Также нельзя улучшить, уничтожить дом находящийся вне разрешенного радиуса влияния 
6. колодец первого ровня радиус = квадрат 2 кл. с каждого тайла воды в радиусе +1 вода в тик. колодец второго уровня радиус = квадрат 3 кл. с каждого тайла воды в радиусе +2 вода в тик. колодец третьего уровня радиус = квадрат 4 кл. с каждого тайла воды в радиусе +3 вода в тик. сама постройка колодца дает +5/10/15 вода в тик соответственно уровню. 
7.вынести газету городские вести в отдельное поле чтобы его постоянно было видно как и игровое поле
8.  церкви снизить влияние на веру (или повышать порог требования к вере для увеличения радиуса влияния более радиуса равного 5 кл)
9. возможность переименовывать районы
10. загрязнение - не влияет на закрыет потребности в здоровье у дома. загрязнение влияет только на экологию района + повышает шанс эпидемии в районе.
11. завод (убрать загрязнение: - здоровье) (добавить Загрязнение: - экология района + шум в радиусе)
12. только целые числа в ресурсах (еда, вода, монеты, ресурсы) и в росте жителей дома.
13.с каждым новым уровнем школы увеличивается радиус влияния школы на 1 кл. (1 уровень = 3 кл, 2 уровень = 4 кл, 3 уровень = 5 кл) и её capasity (кол-во жителей, которые могут быть образованы) увеличивается на 10 жителей с каждым уровнем школы.
14. при наведении на школу подсвечивать дома которые получили образование (одним цветом) и дома которые получают образование в данный момент (другим цветом). также подсвечивать дома (третьим цветом) которые не могут получить образование по каким либо условиям, но находящиеся в радиусе действия школы.
15. при постройке дома в радиусе действия школы, у которой уже заполнен лимит на образование, не закрывать потребность построенного дома в образовании